{
  "backend/main.mo": "Core actor defining types, state maps, and helper functions for categories, products, garden centers, users, and orders with support for parentCategoryId.",
  "backend/migration.mo": "Migration module converting old category and product records to new formats by adding parentCategoryId fields set to null.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs for hierarchical category taxonomy support.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including pages, hooks, components, and layout.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables for light and dark modes with custom color tokens.",
  "frontend/index.html": "Basic HTML document that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main application router defining all routes and wrapping the app with theme and cart providers.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component showing an access denied message with a link back to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button managing Internet Identity login/logout with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog for first‑time authenticated users to enter and save their name profile.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards routes so only users with platform admin role can access, showing loaders or access denied states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and prompts unauthenticated users to log in via Internet Identity.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Restricts access to users with customer role, showing loading or denial screens when appropriate.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Allows access only for garden center members or platform admins, with loading and denied states.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Ensures only platform admins can view wrapped content, otherwise showing loaders or access denied.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with header, footer, and routed main content.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Renders social media buttons linking to WhatsApp, Instagram, and email contact options.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the site's footer with brand info, quick links, and contact options.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the responsive site header with navigation, role‑based portal links, and user/cart controls.",
  "frontend/src/components/store/CartBadge.tsx": "Shows a small badge with the number of cart items when the cart is non‑empty.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product preview card with image, details, stock status, and navigation to product page.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "Provides mutations for adding products, toggling active status (unimplemented), and initializing seed data with query invalidation and error toasts.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches active products for a garden center by filtering all active products due to missing backend support.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Manages garden center queries and mutations for adding/removing members, with several backend functions unimplemented.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches the caller’s role and exposes a helper to check platform admin status.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Loads the current user’s profile via actor.getCallerUserProfile with loading state handling.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Queries whether the caller is an admin using actor.isCallerAdmin.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Provides a mutation to save the caller’s user profile and invalidate related queries.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a garden center and invalidates role and garden center queries on success.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Fetches and manages products for a garden center, adding and updating products with some features unimplemented.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Returns the caller’s primary garden center using a placeholder structure due to missing backend support.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Updates a garden center’s name and location and invalidates related queries on success.",
  "frontend/src/hooks/orders/useOrders.ts": "Fetches user orders but currently returns an empty list due to missing backend support.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Attempts to place an order but always errors because backend support is not implemented.",
  "frontend/src/hooks/storefront/useCategories.ts": "Fetches all product categories from the backend.",
  "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts": "Loads the full category taxonomy tree via actor.getFullCategoryTaxonomy.",
  "frontend/src/hooks/storefront/useProduct.ts": "Fetches a single product by ID from the backend.",
  "frontend/src/hooks/storefront/useProducts.ts": "Provides queries for active products, category‑filtered products, and client‑side search results.",
  "frontend/src/hooks/useActor.ts": "Creates a React Query-managed backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored delegation loading, and identity state.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for theming, including light and dark mode color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin interface for managing garden centers, including listing, expanding details, and actions to enable, disable, or remove members and nurseries. Uses confirmation dialogs and multiple admin hooks.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page with a form to add products, toggle product active status, initialize seed data, and view existing active products. Integrates category fetching and various admin mutation hooks.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, allowing quantity updates, item removal, and navigation to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Shows product catalog with search, category filters, and taxonomy-based product filtering.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders checkout flow, requiring authentication, showing order summary, and submitting orders via mutation.",
  "frontend/src/pages/HomePage.tsx": "Renders the storefront homepage with a hero section, feature cards, and category loading via taxonomy hooks. Includes navigation buttons and responsive layout components.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the authenticated user's orders with status badges, product details, loading skeletons, and total amounts. Wraps content in an auth guard.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Nursery dashboard page that loads garden center data, taxonomy, and products, and provides editing and product creation UI with dialogs and form handling.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows an order confirmation message and optional order ID, with links to view orders or continue shopping. Uses URL search params to read the order ID.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Checks customer role and redirects authenticated customers to the catalog, showing loading skeletons or access denied when appropriate.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Handles nursery portal access, redirects existing members to the dashboard, and provides a registration form for creating a new garden center.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Validates platform admin access and redirects admins to the nursery admin page or shows access denied.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product info with image gallery, quantity selection, and add‑to‑cart logic. Handles loading, missing products, and navigation.",
  "frontend/src/store/cart/CartProvider.tsx": "React context provider managing cart state with persistence, quantity updates, totals, and CRUD operations.",
  "frontend/src/store/cart/cartStorage.ts": "LocalStorage-backed helpers for loading, saving, and clearing versioned cart data.",
  "frontend/src/store/cart/types.ts": "Type definitions for cart items, state, actions, and context shape.",
  "frontend/src/store/cart/useCart.ts": "Hook exposing the cart context and enforcing usage within the CartProvider.",
  "frontend/src/utils/categoryTaxonomy.ts": "Utility functions for flattening, querying, and inspecting hierarchical category taxonomies.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters, including hash query parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and plugins for styling the frontend.",
  "project_state.json": "Project state file defining app requirements, architecture notes, known issues, and feature versions for the GreenPlantz web and mobile platform."
}