{
  "backend/main.mo": "Defines types and in-memory maps for categories, products, garden centers, orders, plant lists, and authorization helpers with search and lookup utilities.",
  "feature_evidence.json": "Feature evidence report describing required asset updates, logo changes, favicon generation, and associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files covering layout, pages, components, and theme configuration.",
  "frontend/index.css": "Tailwind base layers defining theme variables for light and dark modes with extensive OKLCH color tokens.",
  "frontend/index.html": "HTML entry file loading main script and referencing cache‑busted favicon assets.",
  "frontend/src/App.tsx": "Sets up app-wide theming, cart provider, routing tree, and all route mappings using TanStack Router.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access denied message with optional principal ID panel and link back to home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with error handling and react-query cache clearing.",
  "frontend/src/components/auth/PrincipalIdPanel.tsx": "Panel displaying a principal ID with copy-to-clipboard support and status feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Restricts access to admin-only pages, showing loaders or an access denied screen based on role state.",
  "frontend/src/components/auth/RequireAuth.tsx": "Blocks access for unauthenticated users and shows a login prompt card.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Allows access only to authenticated users with a customer role, otherwise shows loading or denial.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Checks for garden center membership or admin rights before rendering children, with loading and denial states.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Ensures only platform admins can access the wrapped content and shows an access denied screen otherwise.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the application layout with header, footer, and main outlet content.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Renders social media and contact buttons for WhatsApp, Instagram, and email.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the site footer with branding, quick links, contact info, and social links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the main site header with navigation, role-based portal links, and cart/login elements.",
  "frontend/src/components/store/CartBadge.tsx": "Shows a badge with the number of items in the cart when greater than zero.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product’s image, name, description, price, and stock status with fallback handling.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "Provides mutations for adding products, initializing seed data, and a placeholder for toggling product active state, with query invalidation and toast notifications.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches active products and filters them by garden center ID due to missing backend support for center-specific queries.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Manages garden center data and team member mutations, with several unimplemented backend methods returning placeholders or errors.",
  "frontend/src/hooks/admin/usePlatformAdminAllowlist.ts": "Provides mutations to grant or revoke platform admin access using principals, with query invalidation and toasts.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches the caller's role with fallback handling and exposes a helper for checking admin status.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Loads the caller’s user profile from the backend with basic state handling.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Queries whether the caller is an admin using the backend’s isCallerAdmin method.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Saves the caller’s user profile and invalidates related queries on success.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a garden center through the backend and refreshes related queries.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Retrieves and filters active products by garden center, and provides mutations for adding products plus placeholders for unimplemented updates and toggles.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Returns placeholder garden center data based on caller role due to missing backend support.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Updates a garden center’s name and location, then invalidates relevant queries.",
  "frontend/src/hooks/orders/useOrders.ts": "Returns an empty list of user orders pending backend implementation.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Attempts to create an order but always errors because backend order placement is unimplemented.",
  "frontend/src/hooks/storefront/useCategories.ts": "Fetches all product categories from the backend.",
  "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts": "Loads full category taxonomy including subcategories.",
  "frontend/src/hooks/storefront/useProduct.ts": "Fetches a single product by ID from the backend.",
  "frontend/src/hooks/storefront/useProducts.ts": "Provides React Query hooks to fetch active products, products by category, and perform client‑side product search.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context including login, logout, and persisted identity handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theming with light and dark palettes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, providing query and identity contexts before rendering the main App component.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin interface for managing garden centers, their members, and nursery removal or status changes.",
  "frontend/src/pages/admin/AdminPlatformAdminsPage.tsx": "Admin page for adding or removing platform admins via Principal IDs with validation and dialogs.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI for listing, adding, and toggling activation of products, using category and product hooks with a form for new product creation.",
  "frontend/src/pages/CartPage.tsx": "Displays cart contents with quantity controls, item removal, and a summary section, or an empty‑cart state.",
  "frontend/src/pages/CatalogPage.tsx": "Implements product browsing with search, category filters, taxonomy handling, and dynamic product display.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows an order summary and handles authenticated order placement, redirecting if the cart is empty.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, feature highlights, and category listings using taxonomy data.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays authenticated users’ order history with status badges, product details, and totals.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Nursery dashboard allowing garden center editing and product management, including adding products with images and category selection.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details and links to view orders or continue shopping.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Customer portal that redirects authenticated customers to the catalog and blocks non-customers.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Nursery portal that redirects existing members to the dashboard or allows new nursery registration.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Team portal validating platform admin access, showing loading/error states and redirecting admins to the nursery admin page.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail view with images, description, quantity selection, and add‑to‑cart functionality.",
  "frontend/src/store/cart/CartProvider.tsx": "React context managing cart state with persistence, item updates, totals, and storage syncing.",
  "frontend/src/store/cart/cartStorage.ts": "LocalStorage helpers for loading, saving, and clearing the cart with versioned serialization.",
  "frontend/src/store/cart/types.ts": "Type definitions for cart items, state, actions, and the cart context.",
  "frontend/src/store/cart/useCart.ts": "Hook providing access to the cart context with an error if used outside the provider.",
  "frontend/src/utils/categoryTaxonomy.ts": "Utility functions for flattening category hierarchies, retrieving descendants and leaf categories, and finding category nodes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them from session or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins, defining the design tokens used across the frontend.",
  "project_state.json": "Captures the project’s current state, requirements, issues, and architectural notes for the GreenPlantz platform."
}