{
  "backend/main.mo": "Defines actor types and state for categories, products with image URLs, orders, user profiles, and garden centers, including access control and helper functions.",
  "backend/migration.mo": "Migration module converting OldProduct records to NewProduct by adding an imageUrls field and returning updated actor state.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains a collection of short summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme, cart, and router providers.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component showing an access-denied card with optional message and home navigation button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with state handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects routes by checking admin role, showing loaders or access denied when appropriate.",
  "frontend/src/components/auth/RequireAuth.tsx": "Blocks access for unauthenticated users and displays a login prompt card.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Guards routes for customer role, showing loading or access denied screens as needed.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Allows access only to garden center members or admins, otherwise shows loading or denied.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Route guard requiring platform admin privileges with loading and denial fallback.",
  "frontend/src/components/layout/AppShell.tsx": "Page layout wrapper with header, routed content outlet, and footer.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Renders a set of social media links with icons in a compact footer widget.",
  "frontend/src/components/layout/SiteFooter.tsx": "Full footer with branding, quick links, contact info, and social link section.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, role-based portal links, and shopping cart badge.",
  "frontend/src/components/store/CartBadge.tsx": "Displays a numeric badge for total cart items when count is nonzero.",
  "frontend/src/components/store/ProductCard.tsx": "Product listing card showing image, name, description, price, and stock status.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "Provides mutations for adding products, toggling product active state, and initializing seed data, with query invalidation and toast feedback.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches products for a specified garden center for admin views using react-query.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Provides queries and mutations for managing garden centers and their members, including adding, removing, enabling, and disabling members.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches the caller's role and exposes a helper to check if the caller is a platform admin.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Fetches the authenticated user's profile with loading state handling.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Checks if the authenticated caller is an admin via a simple boolean query.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Mutates and saves the caller's user profile and invalidates the related query on success.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a garden center and invalidates role and garden center queries after success.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Fetches, adds, updates, and toggles products for a specific garden center with appropriate query invalidation.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Fetches the garden center associated with the caller’s primary membership.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Updates garden center details and invalidates related queries upon success.",
  "frontend/src/hooks/orders/useOrders.ts": "Provides a placeholder query for fetching user orders, currently returning an empty list.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Places an order based on cart items and invalidates the orders query on success.",
  "frontend/src/hooks/storefront/useCategories.ts": "Fetches the list of product categories for storefront use.",
  "frontend/src/hooks/storefront/useProduct.ts": "Fetches a single product by ID for product detail views.",
  "frontend/src/hooks/storefront/useProducts.ts": "Provides queries for active products, category-filtered products, and product search.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor instance based on user identity and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login, and logout helpers. Wraps AuthClient creation and persists identities across reloads.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theming, including light and dark mode palettes. Adds global typography and a custom container class.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider. Loads global CSS and renders the App component.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin interface for managing garden centers, including member actions and nursery removal with confirmation dialogs.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI for adding products, toggling product activation, and initializing seed data alongside listing active products.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with quantity controls, item removal, totals, and a clear-cart action. Shows an empty-state message when the cart has no items.",
  "frontend/src/pages/CatalogPage.tsx": "Shows product listings with search, category filtering, and loading skeletons. Fetches categories and products, updating results based on user input.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders order summary and handles order placement, requiring user authentication. Redirects from empty carts and shows a profile setup dialog when needed.",
  "frontend/src/pages/HomePage.tsx": "Displays the storefront home page with a hero section, feature highlights, and category previews. Loads categories and links users to the catalog.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays a user's order history with status, product details, totals, and loading states, gated behind authentication.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Nursery dashboard for managing garden center details and adding or modifying nursery products with images.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows an order confirmation message and optional order ID, with links to view orders or continue shopping.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Redirects authenticated customers to the catalog or shows access denial for non-customer roles.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Nursery portal page that checks user role, redirects existing members, and provides a nursery registration form for new users.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Team portal page that restricts access to platform admins and redirects authorized users to the admin nurseries view.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product info with images and allows adding the item to the cart.",
  "frontend/src/store/cart/CartProvider.tsx": "Provides cart context with add, update, remove, clear, and persistence logic using localStorage.",
  "frontend/src/store/cart/cartStorage.ts": "Handles loading, saving, and clearing cart data in localStorage with versioning and bigint support.",
  "frontend/src/store/cart/types.ts": "Type definitions for cart items, cart state, cart actions, and the combined cart context type.",
  "frontend/src/store/cart/useCart.ts": "Custom hook that exposes the cart context and enforces use within CartProvider.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, typography, animations, and plugins for the GreenPlantz design system.",
  "project_state.json": "Project metadata describing state, requirements, architecture notes, and implemented features for the GreenPlantz platform."
}