{
  "backend/main.mo": "Defines core types and in-memory maps for categories, products, users, garden centers, and orders, plus admin bootstrapping and a mock folder-listing API guarded by access control.",
  "feature_evidence.json": "Lists two INR currency-formatting features with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Maps frontend file paths to short, human‑written summaries describing layout, pages, styling, and component behavior.",
  "frontend/index.css": "Tailwind base layer defining extensive OKLCH variable-based light and dark mode color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app root and favicon assets.",
  "frontend/REPO_FOLDER_TREE.md": "Auto-generated placeholder document for the frontend folder tree with a command to regenerate it.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, cart context, and the main application shell.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access-denied UI card showing an error message, optional principal ID, and a home-navigation button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with reactive status and query cache clearing.",
  "frontend/src/components/auth/PrincipalIdPanel.tsx": "Displays the user's principal ID with copy-to-clipboard support and toast notifications.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting authenticated users without a profile to enter their name and save it.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards routes so only authenticated platform admins can access them, showing loaders or access-denied states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and forces login when the user is unauthenticated, displaying a login prompt.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Restricts access to authenticated users with a customer role, with loading and access-denied handling.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Allows access only to authenticated garden center members or platform admins, with loading and denial states.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Limits access to authenticated platform admins and shows detailed access-denied information if not allowed.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper providing header, footer, and routed page content.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Displays social media and contact links as styled buttons in the footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, quick links, contact details, and social links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Top navigation bar showing links, portals, admin options, and a responsive mobile menu based on user role.",
  "frontend/src/components/store/CartBadge.tsx": "Shows a small badge with the cart item count when items are present.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product preview card with image fallback, price, stock status, and link to the product page.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "React Query hooks for adding products, verifying products, initializing seed data, and a stub for toggling active state.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches active products for a garden center by filtering all active products.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Admin hooks for managing garden centers and team members, with several backend features not yet implemented.",
  "frontend/src/hooks/admin/usePlatformAdminAllowlist.ts": "Mutations for granting and revoking platform admin access via principals.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches caller role with fallback handling and helper to check admin status.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Gets the current user's profile using React Query.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Simple hook checking if the caller is an admin via backend call.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Mutation for saving the caller's user profile and invalidating cache.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a new garden center and refreshes related queries.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Gets or mutates products within a garden center, with fallbacks for missing backend methods.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Fetches the garden center associated with the current user's primary membership.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Updates garden center details and invalidates related queries.",
  "frontend/src/hooks/orders/useOrders.ts": "Fetches user orders but currently returns an empty list due to missing backend support.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Stub mutation for placing orders, currently unimplemented on the backend.",
  "frontend/src/hooks/storefront/useCategories.ts": "Fetches category list from backend.",
  "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts": "Retrieves full category taxonomy including subcategories.",
  "frontend/src/hooks/storefront/useProduct.ts": "Fetches an individual product by ID.",
  "frontend/src/hooks/storefront/useProducts.ts": "Provides React Query hooks to fetch active products, products by category, and perform client-side product search using the actor API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user’s identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider handling login, stored identity loading, and exposing identity state to the app.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with an earthy green palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin interface to view, expand, and manage garden centers, members, and removal actions.",
  "frontend/src/pages/admin/AdminPlatformAdminsPage.tsx": "Admin tool to add or remove platform admins by Principal ID with validation and mutations.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for adding, verifying, and toggling product activity using category and product queries.",
  "frontend/src/pages/CartPage.tsx": "Displays cart contents with quantity controls, item removal, totals, and navigation to product browsing or checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Renders product catalog with search, category filtering, taxonomy handling, and dynamic product listing.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows order review and summary, requires user authentication, and triggers order placement before redirecting to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, feature cards, and category loading using taxonomy hooks.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays user's past orders with status badges and skeleton loading, gated by auth.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Nursery dashboard for managing garden center details and products, including creation, editing, and stock updates.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details using search params and links to orders or catalog.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Redirects authenticated customers to the catalog and denies access otherwise.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Handles nursery access; redirects existing members to dashboard or allows new nursery registration.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Platform admin access handler that redirects admins and shows access/error states for others.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays product details with image gallery, quantity selector, and cart add.",
  "frontend/src/store/cart/CartProvider.tsx": "Provides cart context with persistent storage, item management, totals, and state updates.",
  "frontend/src/store/cart/cartStorage.ts": "Implements versioned localStorage handling for loading, saving, and clearing cart data.",
  "frontend/src/store/cart/types.ts": "Defines cart item, state, actions, and context types.",
  "frontend/src/store/cart/useCart.ts": "Hook for accessing the cart context with error enforcement.",
  "frontend/src/utils/categoryTaxonomy.ts": "Utilities for flattening and querying category taxonomy, including leaf detection and tree traversal.",
  "frontend/src/utils/errorMessage.ts": "Converts unknown error inputs into a safe message, prioritizing Error.message or JSON-stringifiable object data.",
  "frontend/src/utils/money.ts": "Formats a cents/paise numeric value into an INR currency string using Intl.NumberFormat.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, container settings, and plugins.",
  "frontend/tools/FOLDER_LISTING_COMMAND.md": "Documentation describing how to run the folder listing tool from the repository root.",
  "frontend/tools/list-folders.config.json": "Configuration for the folder listing tool specifying ignored directories, depth, and root folders.",
  "frontend/tools/list-folders.mjs": "CLI script that recursively lists project folders, applying config rules, and can output tree or markdown formats.",
  "project_state.json": "Holds project state metadata, requirements, architecture notes, and known issues for the GreenPlantz build."
}