{
  "backend/main.mo": "Defines core data types and storage maps for categories, products, garden centers, orders, and users, plus authorization helpers and search functionality.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files and components for the GreenPlantz app.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color tokens, CSS variables, and dark mode theme rules.",
  "frontend/index.html": "Minimal HTML entry point loading the React app and linking favicon assets.",
  "frontend/src/App.tsx": "Sets up global providers and full TanStack Router route tree for all public, admin, and portal pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access-denied message with optional principal ID and a button back to home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic state handling and query cache clearing.",
  "frontend/src/components/auth/PrincipalIdPanel.tsx": "Card displaying the user's principal ID with copy-to-clipboard support and feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter their name and save their profile.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper enforcing platform-admin access using caller role lookup with loading and denial states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Displays a login prompt when the user is not authenticated; otherwise renders its children.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Checks caller role and authentication, showing loading or access denied screens, and only allows customers to proceed.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Grants access only to authenticated users who are garden center members or platform admins, with loading and denial states.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Restricts access to authenticated platform admins and shows loading or denial states with principal ID when unauthorized.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main page layout with header, footer, and routed content area.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Renders a set of social media links with icons for WhatsApp, Instagram, and email.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays footer with brand info, quick links, social/contact links, and service area details.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with navigation, account‑aware portal links, admin links, and mobile menu.",
  "frontend/src/components/store/CartBadge.tsx": "Shows a small badge with the cart item count, hidden when the cart is empty.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product card with image, details, price, stock status, and link to the product page.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "Provides mutations for adding products, initializing seed data, and a placeholder for toggling product active state.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches products for a garden center by filtering active products when backend support is missing.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Provides React Query hooks for listing garden centers and mutating team membership, with several methods stubbed until backend support exists.",
  "frontend/src/hooks/admin/usePlatformAdminAllowlist.ts": "Defines mutations to grant or revoke platform admin access using the actor and invalidates caller role queries.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches the caller's role from the backend and provides a helper to check if the caller is a platform admin.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Retrieves the authenticated user's profile from the backend with loading state tied to actor resolution.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Queries whether the current caller is an admin by calling isCallerAdmin on the actor.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Provides a mutation to save the caller's user profile and refresh related profile queries.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a new garden center via the actor and invalidates related queries on success.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Fetches and manages products for a garden center, with fallbacks where backend methods are missing.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Fetches the caller’s primary garden center using role data and returns placeholder data until backend support exists.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Updates a garden center’s basic info and invalidates relevant queries after mutation.",
  "frontend/src/hooks/orders/useOrders.ts": "Retrieves orders for the user but currently returns an empty list due to missing backend support.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Attempts to place an order by mapping cart items but throws because backend functionality is not implemented.",
  "frontend/src/hooks/storefront/useCategories.ts": "Loads all categories from the backend using React Query.",
  "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts": "Fetches full category taxonomy including subcategories from the backend.",
  "frontend/src/hooks/storefront/useProduct.ts": "Retrieves a single product by ID using the actor.",
  "frontend/src/hooks/storefront/useProducts.ts": "Provides hooks for active products, category-filtered products, and client-side search fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient creation with custom options and exposes status flags.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines custom CSS variables for themes, colors, and layout. Includes global styles and a reusable container class.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers. Loads global styles and renders the root App component.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin page for managing garden centers, including expanding details, managing members, and removing or disabling entries.",
  "frontend/src/pages/admin/AdminPlatformAdminsPage.tsx": "Allows platform admins to add or remove admin users by validating and submitting Principal IDs.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for adding new products, toggling product active status, viewing categories, and initializing seed data.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, allowing quantity updates, item removal, and checkout navigation. Displays an empty state or a detailed cart summary.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a searchable and filterable product catalog using category taxonomy and search hooks. Manages category filters, search input, and dynamic product listing.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows order summary and handles order placement, requiring user authentication via Internet Identity. Redirects if the cart is empty and clears the cart on successful order.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero section, features, and top-level category listings. Fetches category taxonomy and displays marketing content with navigation links.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the logged‑in user's order history with loading skeletons, empty state, and order details including products and totals.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Dashboard page for nursery members to manage garden center info and products, including editing details and adding new products with categories and images.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows an order confirmation message and optionally displays the order ID with links to view orders or continue shopping.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Redirects authenticated customers to the catalog and shows loading or access‑denied states based on role.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Handles nursery member or admin access, redirecting existing members to the dashboard or allowing new nursery registration.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Checks for platform admin access and redirects to admin pages or shows access‑denied with principal info.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product info with image gallery, quantity selector, and add‑to‑cart functionality.",
  "frontend/src/store/cart/CartProvider.tsx": "Provides cart context with persistence, item management, totals, and quantity updates.",
  "frontend/src/store/cart/cartStorage.ts": "Implements localStorage persistence for cart items with versioning and BigInt handling.",
  "frontend/src/store/cart/types.ts": "Defines types for cart items, state, actions, and context.",
  "frontend/src/store/cart/useCart.ts": "Hook to access the cart context with an enforced provider requirement.",
  "frontend/src/utils/categoryTaxonomy.ts": "Utility functions to flatten category taxonomies, find nodes, check leaf status, and gather descendants.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for a themed UI with container settings and extended design tokens.",
  "project_state.json": "Defines the project's state, including high-level goals, architectural notes, known issues, and existing feature metadata for the GreenPlantz platform."
}