{
  "backend/main.mo": "Defines the main actor with data models, in‑memory maps, access control setup, admin bootstrap, and a mock folder‑listing API.",
  "backend/migration.mo": "Provides a migration module that maps an OldActor state to the updated NewActor state by passing through fields unchanged.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no recorded features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files including pages, components, and configuration.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light and dark modes with global resets.",
  "frontend/index.html": "Base HTML entry point including favicon links and mounting root for the frontend app.",
  "frontend/REPO_FOLDER_TREE.md": "Auto‑generated document stub for the repository folder tree with instructions for regeneration.",
  "frontend/src/App.tsx": "Configures the TanStack Router, app routes, providers, and the application shell wrapper.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access‑denied message with optional principal ID panel and a navigation button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading state and session clearing.",
  "frontend/src/components/auth/PrincipalIdPanel.tsx": "Displays the user’s principal ID with copy‑to‑clipboard functionality and status feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog for new authenticated users to enter and save their name using profile hooks.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects routes by requiring admin role, showing loading skeletons or an access denied screen.",
  "frontend/src/components/auth/RequireAuth.tsx": "Blocks access for unauthenticated users and prompts them to log in via Internet Identity.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Restricts content to authenticated customers, showing skeletons or an access denied message if needed.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Allows access only for authenticated users with garden center memberships or admin privileges.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Ensures only platform admins can access certain pages, displaying principal ID if denied.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main page layout with header, footer, and outlet for routed content.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Renders social media and email links with icons for the site footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays footer with branding, quick links, contact info, and social links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with navigation, role-based portal links, and responsive mobile menu.",
  "frontend/src/components/store/CartBadge.tsx": "Shows a badge with the cart item count when items are present.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product’s image, details, and stock status with fallback for broken images.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "Provides mutations for adding products, initializing seed data, and a placeholder for toggling product state with query invalidation and toast notifications.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches active products filtered by garden center ID using a fallback since the backend lacks a direct method.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Defines garden center types and provides mutations for managing team members, with several operations unimplemented on the backend.",
  "frontend/src/hooks/admin/usePlatformAdminAllowlist.ts": "Grants or revokes platform admin access using mutation hooks and updates caller role state.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches the caller's role with fallback handling and exposes a helper to check admin status.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Retrieves the caller’s user profile via a query hook.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Checks if the caller is an admin by invoking isCallerAdmin on the actor.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Saves the caller’s user profile and refreshes cached profile data.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a new garden center and invalidates related queries on success.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Gets products for a garden center using a fallback filter and includes mutations for adding, updating, and toggling products, with some actions unimplemented.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Returns placeholder garden center data for the caller due to missing backend support.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Updates garden center info and invalidates relevant cached queries.",
  "frontend/src/hooks/orders/useOrders.ts": "Fetches user orders but returns an empty list until backend support is added.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Attempts to place an order but always errors because backend functionality is missing.",
  "frontend/src/hooks/storefront/useCategories.ts": "Fetches all product categories from the backend.",
  "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts": "Retrieves the full category taxonomy including subcategories.",
  "frontend/src/hooks/storefront/useProduct.ts": "Fetches a single product by ID using the backend actor.",
  "frontend/src/hooks/storefront/useProducts.ts": "Hooks that fetch active products, products by category, and perform client‑side product search using the actor API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, handles login/logout, and restores identities via an AuthClient.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, theming, and base layout styles.",
  "frontend/src/main.tsx": "Initializes the app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin page for managing garden centers, including member actions and nursery removal with confirmation dialogs.",
  "frontend/src/pages/admin/AdminPlatformAdminsPage.tsx": "Admin interface to add or remove platform admin Principal IDs with validation and mutation handling.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for adding products, toggling product activity, and initializing seed data using category and product hooks.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, item removal, and a summary section.",
  "frontend/src/pages/CatalogPage.tsx": "Renders the product catalog with search, category filters, taxonomy-based grouping, and product listings.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows order summary, handles placing orders, and requires user authentication to complete checkout.",
  "frontend/src/pages/HomePage.tsx": "Home page showing a hero section, feature cards, and category listing using fetched taxonomy.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's order history with statuses, item details, totals, and loading/empty states.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Nursery dashboard for editing garden center details and managing nursery products, categories, and images.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a confirmation message after checkout and optionally displays the order ID with navigation buttons.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Customer portal that redirects authenticated customers to the catalog or shows access errors.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Nursery portal that redirects existing members to the dashboard or allows new nursery registration.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Team portal that verifies platform admin access, showing loading, error, or access-denied states accordingly.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Renders product details, image gallery, quantity selection, and add-to-cart logic with loading and not-found handling.",
  "frontend/src/store/cart/CartProvider.tsx": "React context provider managing cart state, persistence, and operations like add, update, remove, and clear.",
  "frontend/src/store/cart/cartStorage.ts": "LocalStorage helpers for loading, saving, and clearing cart data with versioning and bigint handling.",
  "frontend/src/store/cart/types.ts": "Type definitions for cart items, state, actions, and the cart context.",
  "frontend/src/store/cart/useCart.ts": "Custom hook for accessing the cart context with error handling if used outside provider.",
  "frontend/src/utils/categoryTaxonomy.ts": "Utility functions for flattening category taxonomies, retrieving descendants, leaves, and searching by ID.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "frontend/tools/FOLDER_LISTING_COMMAND.md": "Documentation for using the folder-listing tool to print a deterministic folder tree.",
  "frontend/tools/list-folders.config.json": "Configuration for the folder-listing tool specifying ignored directories, recursion depth, and root folders.",
  "frontend/tools/list-folders.mjs": "CLI script that scans directories, filters ignored folders, and generates a deterministic folder tree or markdown output.",
  "project_state.json": "Tracks project state, goals, architectural notes, known issues, and feature metadata for the GreenPlantz application."
}