{
  "backend/main.mo": "Defines core data types and in-memory maps for categories, products, garden centers, orders, access control, and helper functions including substring search and authorization checks.",
  "feature_evidence.json": "Contains feature evidence entries describing logo-related tasks, affected components, and associated test IDs.",
  "frontend-file-summaries.txt": "Lists high‑level summaries for all major frontend files, describing layout, routing, pages, UI components, and theme configuration.",
  "frontend/index.css": "Defines base Tailwind layers and extensive OKLCH theme variables for light and dark modes, applying global background and text styles.",
  "frontend/index.html": "HTML entrypoint setting page metadata, favicon assets, and mounting the React application.",
  "frontend/src/App.tsx": "Sets up the TanStack Router route tree, theme provider, cart provider, and application shell for all pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access‑denied UI with message, optional principal info panel, and a button linking home.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button wired to Internet Identity with state handling and query cache clearing.",
  "frontend/src/components/auth/PrincipalIdPanel.tsx": "Displays the user's principal ID with copy‑to‑clipboard functionality and toast feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name. Handles form submission and shows toast notifications.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard that checks for authentication and admin role, showing loading skeletons or access denied when appropriate.",
  "frontend/src/components/auth/RequireAuth.tsx": "Component that blocks unauthenticated access and shows a login prompt until the user is authenticated.",
  "frontend/src/components/auth/RequireCustomer.tsx": "Route guard ensuring the user is authenticated and has a customer role, with loading and access-denied states.",
  "frontend/src/components/auth/RequireGardenCenterMember.tsx": "Route guard requiring garden center membership or platform admin status, with skeleton loading and access-denied handling.",
  "frontend/src/components/auth/RequirePlatformAdmin.tsx": "Route guard for platform admins, showing loading skeletons or access denied with principal ID if unauthorized.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper providing header, footer, and routing outlet.",
  "frontend/src/components/layout/FooterSocialLinks.tsx": "Renders social media/contact buttons for WhatsApp, Instagram, and email.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with brand info, quick links, contact details, and social links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with logo, navigation links, role-based portal/admin links, mobile menu, and user/cart controls.",
  "frontend/src/components/store/CartBadge.tsx": "Displays a badge with cart item count when items exist.",
  "frontend/src/components/store/ProductCard.tsx": "Product card showing image, name, description, price, and stock status with fallback handling for broken images.",
  "frontend/src/hooks/admin/useAdminProducts.ts": "Provides mutations for adding products, initializing seed data, and a placeholder for toggling product active state with query invalidation and error toasts.",
  "frontend/src/hooks/admin/useGardenCenterProductsAdmin.ts": "Fetches active products and filters them by garden center for admin views since the backend lacks a direct method.",
  "frontend/src/hooks/admin/useGardenCentersAdmin.ts": "Handles garden center queries and member mutations, with several operations unimplemented in the backend and returning placeholders.",
  "frontend/src/hooks/admin/usePlatformAdminAllowlist.ts": "Provides mutations to grant and revoke admin access by principal and invalidates caller role data.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches the caller’s role with error fallback and exposes a helper to check admin status.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Queries the current user profile via the actor with basic loading state merging.",
  "frontend/src/hooks/auth/useCallerUserRole.ts": "Fetches a simple boolean indicating whether the caller is an admin.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Mutation to save the caller’s user profile and refresh profile queries.",
  "frontend/src/hooks/nursery/useCreateGardenCenter.ts": "Creates a new garden center and invalidates related role and center queries on success.",
  "frontend/src/hooks/nursery/useGardenCenterProducts.ts": "Fetches products for a garden center by filtering active products and supports mutations for adding or placeholder-updating products.",
  "frontend/src/hooks/nursery/useMyGardenCenter.ts": "Retrieves the caller’s primary garden center using a temporary placeholder structure due to missing backend support.",
  "frontend/src/hooks/nursery/useUpdateGardenCenter.ts": "Mutation to update garden center details and invalidate corresponding queries.",
  "frontend/src/hooks/orders/useOrders.ts": "Fetches user orders but currently returns an empty list due to missing backend support.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Placeholder mutation for placing orders that currently throws an error because the backend method is unimplemented.",
  "frontend/src/hooks/storefront/useCategories.ts": "Fetches all categories from the backend when the actor is ready.",
  "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts": "Loads the full category taxonomy structure for storefront views.",
  "frontend/src/hooks/storefront/useProduct.ts": "Fetches an individual product from the backend using its ID.",
  "frontend/src/hooks/storefront/useProducts.ts": "React Query hooks for fetching active products, category-filtered products, and client-side searched products.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and loading identities via AuthClient.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and base styling for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminNurseriesPage.tsx": "Admin interface for viewing, expanding, and managing garden centers and their members, including enabling, disabling, and removal actions.",
  "frontend/src/pages/admin/AdminPlatformAdminsPage.tsx": "Admin page for adding and removing platform admin principals with validation and mutation handling.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for adding new products, toggling product active state, and initializing seed data using category and product hooks.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls and total calculations, allowing clearing or navigating to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Shows product listings with search, category filters, and taxonomy-based filtering logic.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders checkout flow with order summary and order placement, requiring user authentication.",
  "frontend/src/pages/HomePage.tsx": "Displays the storefront homepage with hero content, feature cards, and top-level category listings using taxonomy data.",
  "frontend/src/pages/MyOrdersPage.tsx": "Shows the authenticated user's order history with status, product details, totals, and loading/empty states.",
  "frontend/src/pages/nursery/NurseryDashboardPage.tsx": "Nursery dashboard for managing garden center details and products, including editing info, adding products with images, and toggling active status.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Presents an order confirmation message and optionally displays the order ID with navigation options.",
  "frontend/src/pages/portals/CustomerPortalPage.tsx": "Customer portal redirect that sends authenticated customers to the catalog or shows access denial based on role.",
  "frontend/src/pages/portals/NurseryPortalPage.tsx": "Nursery portal that redirects existing members to the dashboard or allows new users to register a garden center.",
  "frontend/src/pages/portals/TeamPortalPage.tsx": "Team portal for platform admins with role-based redirects, loading/error states, and principal ID display.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product information with an image gallery, quantity selection, and add‑to‑cart functionality.",
  "frontend/src/store/cart/CartProvider.tsx": "React context provider managing cart state, persistence, and actions like add, update, remove, and clear.",
  "frontend/src/store/cart/cartStorage.ts": "Utility for loading, saving, and clearing cart data in localStorage with versioning and BigInt handling.",
  "frontend/src/store/cart/types.ts": "Type definitions for cart items, state, actions, and context shape.",
  "frontend/src/store/cart/useCart.ts": "Custom hook to access the cart context and enforce provider usage.",
  "frontend/src/utils/categoryTaxonomy.ts": "Helpers for flattening category taxonomy, finding nodes, and extracting leaf, descendant, and top-level categories.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based), persisting them in sessionStorage, and removing them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, spacing, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project configuration, requirements, issues, and architectural notes for the GreenPlantz web and mobile app build."
}