{
  "kind": "build_request",
  "title": "Update SiteHeader logo to the newly provided image",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-78",
      "text": "Add the newly provided header logo image (the one the user referred to as \"this\") as a static asset under frontend/public/assets/generated/ and generate a header-optimized transparent PNG at exactly 112px height (preserve aspect ratio; no distortion; no extra padding unless needed to avoid clipping) using a cache-busting filename.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the header logo to this"
        ]
      },
      "acceptanceCriteria": [
        "A new logo source image file is present under frontend/public/assets/generated/ (do not serve the image from the backend).",
        "A derived header-optimized transparent PNG at exactly 112px height is present under frontend/public/assets/generated/ with a cache-busting filename.",
        "The generated PNG preserves the logo aspect ratio (no stretching) and has no unnecessary padding unless required to avoid clipping."
      ]
    },
    {
      "id": "REQ-79",
      "text": "Update ONLY the SiteHeader logo <img> element (frontend/src/components/layout/SiteHeader.tsx, the <img> inside the home Link) to reference the newly generated cache-busted 112px-tall logo asset under /assets/generated/, replacing the current src \"/assets/generated/greenplantz-logo-image-9.dim_auto_x112.cb_20260209_01.png\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the header logo to this"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/layout/SiteHeader.tsx header logo <img> src is updated to the new /assets/generated/<new-cache-busted-file>.png path.",
        "No other parts of SiteHeader.tsx are modified besides the header logo <img> element.",
        "The referenced file path exists in the built frontend output, and the header logo no longer appears broken at runtime."
      ]
    },
    {
      "id": "REQ-80",
      "text": "Ensure the updated SiteHeader logo remains responsive and does not overflow the header height (the header container height is h-16) by adjusting sizing classes on ONLY the same SiteHeader logo <img> element if needed, while maintaining the logo’s aspect ratio.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the header logo to this"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, tablet, and desktop breakpoints, the header logo remains fully visible within the header (h-16) without vertical overflow or cropping.",
        "The logo image maintains its original aspect ratio (no distortion).",
        "Any CSS/Tailwind class changes are confined to the same header logo <img> element in SiteHeader.tsx."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not serve generated images from the backend; all branding images must be static assets under frontend/public/assets/generated.",
    "Modify ONLY the header logo <img> element in frontend/src/components/layout/SiteHeader.tsx (the <img> inside the home Link)."
  ],
  "nonGoals": [
    "Do not change the footer logo or favicon assets unless the user explicitly requests it.",
    "Do not redesign the header navigation, routing, or authentication behavior.",
    "Do not introduce new backend APIs or storage for branding assets."
  ],
  "imageRequirements": {
    "required": [
      "Original uploaded header logo image from the user (greenplantz-header-logo-user-upload.source.png)",
      "Header-optimized transparent logo at exactly 112px height, aspect ratio preserved (greenplantz-header-logo-user-upload.dim_auto_x112.cb_20260209_02.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}