{
  "kind": "build_request",
  "title": "Add structured product categories with subcategories and enable filtering + nursery product categorization",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Implement a structured product category taxonomy that supports parent/child relationships so the catalog can represent and filter by: Plants → (Indoor Plants, Outdoor Plants), Seeds, Pots → (Ceramic Pots, Plastic Pots, Fiber Pots), and Fertilizers.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also include categorize the shopping  and filter option.\ncatagories by plants, indoors plants , outdoor plants,  seeds, pots, sub topic of pots ceramic pots, plastic pots , fiber pots, fertilizers"
        ]
      },
      "acceptanceCriteria": [
        "Backend Category type supports representing a category tree (parent category with optional subcategories).",
        "Backend exposes categories in a way that the frontend can render the parent/child structure without hardcoding names.",
        "The category taxonomy includes exactly these labels for user-facing text: Plants, Indoor Plants, Outdoor Plants, Seeds, Pots, Ceramic Pots, Plastic Pots, Fiber Pots, Fertilizers (English spelling as written here)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Update backend seed data initialization to create the full category taxonomy (including subcategories) and ensure seeded products (and/or newly created products) can be assigned to a leaf category (e.g., Indoor Plants, Ceramic Pots).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "catagories by plants, indoors plants , outdoor plants,  seeds, pots, sub topic of pots ceramic pots, plastic pots , fiber pots, fertilizers"
        ]
      },
      "acceptanceCriteria": [
        "Calling the existing seed initializer results in categories that include the requested parents and subcategories.",
        "At least one seeded product is assigned to one of the requested categories so storefront filtering can be verified end-to-end.",
        "Existing public product listing endpoints continue to work with the updated category model."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Update the storefront catalog filtering UI (frontend/src/pages/CatalogPage.tsx) to support filtering by the new hierarchical categories (parents + subcategories), including the ability to filter specifically by Pots subcategories (Ceramic Pots, Plastic Pots, Fiber Pots).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also include categorize the shopping  and filter option.\ncatagories by plants, indoors plants , outdoor plants,  seeds, pots, sub topic of pots ceramic pots, plastic pots , fiber pots, fertilizers"
        ]
      },
      "acceptanceCriteria": [
        "Catalog page allows users to filter products by any of the requested categories, including subcategories under Plants and Pots.",
        "Filtering works correctly with search: when a search term is entered, category filtering still narrows results.",
        "All user-facing filter labels are in English."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update the nursery product creation flow (frontend/src/pages/nursery/NurseryDashboardPage.tsx) so garden nursery team members can assign a category/subcategory from the structured taxonomy when adding a product, and ensure the selected category is sent to the backend as the product’s categoryId.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and also when a garden nursery team add product they should be able to catagorize it."
        ]
      },
      "acceptanceCriteria": [
        "Add Product dialog supports selecting a category from the full taxonomy, including Pots subcategories.",
        "Submitting a new product sends the selected (sub)category ID to the backend and the created product appears in that category filter on the catalog page.",
        "All user-facing text in the nursery product categorization UI is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui; compose components instead.",
    "Use existing auth/role guards and access control patterns; do not introduce third-party authentication."
  ],
  "nonGoals": [
    "Fixing Team/Admin portal access or displaying the Internet Identity principal ID in the UI (not requested in the latest user message).",
    "Adding new payment providers, external databases, or non-Internet-Computer hosting/deploy changes.",
    "Changing product image URL functionality beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}