{
  "kind": "build_request",
  "title": "Fix Team/Admin portal access by persisting and bootstrapping platform-admin allowlist in backend",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-98",
      "text": "Persist the backend platform-admin allowlist/authorization state across canister upgrades and redeployments so Team/Admin portal access does not reset after an upgrade. Update backend/main.mo so the AccessControl state used by isPlatformAdmin()/getCallerRole() is stored in stable state and is restored correctly after upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now check all the files in it and clear the admin portal access issue"
        ]
      },
      "acceptanceCriteria": [
        "After upgrading the canister, any previously granted platform-admin principals are still recognized as platform admins (no manual post-upgrade UI call required to restore access).",
        "Calling getCallerRole() for a principal that was a platform admin before the upgrade returns isPlatformAdmin == true after the upgrade.",
        "The Team/Admin portal access behavior is consistent across fresh deploys and subsequent upgrades (no regression back to Access Denied solely due to upgrade)."
      ]
    },
    {
      "id": "REQ-99",
      "text": "Bootstrap initial platform-admin access in the backend during canister initialization and after upgrades (post-upgrade) so production does not require any manual UI call to grant the first admin. Ensure these Internet Identity Principal IDs are present in the platform-admin allowlist and recognized by getCallerRole().isPlatformAdmin: b6cav-3sd7q-navb4-zf3yt-52cnf-gzonh-zab4f-rnkfa-fg42t-64thx-7qe; 7sopg-rkdvi-vg7tv-4foks-ejhyr-rotwu-wcdxm-kkij6-zwzel-qownx-aae; robrk-rlmg7-56hiy-epen2-2jh4m-nqatd-jy2m5-dujk3-lsrep-yu33m-cqe; 2dvk3-yimfn-ghip2-q6c5t-ybd66-6ewxf-fn4nx-zdku7-5ke3s-u2wra-kqe.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now check all the files in it and clear the admin portal access issue"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh deploy (with no prior calls to grantAdminAccess), signing in as any of the listed principals and calling getCallerRole() returns isPlatformAdmin == true.",
        "On a fresh deploy, an authenticated principal not in the bootstrap list receives isPlatformAdmin == false from getCallerRole().",
        "After an upgrade, the listed principals remain platform admins even if no UI/API calls are made post-upgrade."
      ]
    },
    {
      "id": "REQ-100",
      "text": "If implementing REQ-98/REQ-99 requires a backend stable-state schema change, add a conditional Motoko migration in backend/migration.mo that preserves existing application data and safely initializes any new stable authorization/allowlist fields without trapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now check all the files in it and clear the admin portal access issue"
        ]
      },
      "acceptanceCriteria": [
        "When upgrading from the current deployed version, the canister upgrade completes without trapping.",
        "Existing in-canister data (categories, products, garden centers, orders, user profiles, counters) remains available after the upgrade.",
        "New stable authorization/allowlist fields are initialized and usable immediately after upgrade (no manual repair step)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep all Motoko logic in backend/main.mo (generate backend/migration.mo only if a state upgrade is required).",
    "Do not edit files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text (UI copy already present; do not introduce non-English messages)."
  ],
  "nonGoals": [
    "Logo/favicon/header/footer asset changes.",
    "Implementing new admin UI screens or changing existing portal routing beyond what is necessary to make platform-admin authorization work reliably.",
    "Adding any third-party authentication provider (Internet Identity remains the only auth method)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}