{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show authenticated Principal ID and add platform-admin allowlist management UI",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Display the authenticated Internet Identity Principal ID on Team Portal and access-denied screens for easy copy/paste allowlisting (English labels).",
      "acceptanceCriteria": [
        "When a user is authenticated and visits /portal/team, the page shows their Internet Identity Principal ID in a copyable/readable format (e.g., \"Your Principal ID: <principal>\")",
        "When a user is authenticated but not a platform admin and sees the access denied message, the screen also shows the user’s Principal ID",
        "All user-facing labels/messages added for this are in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/PrincipalIdPanel.tsx",
          "operation": "create",
          "description": "Create a small reusable UI panel that renders \"Your Principal ID\" and the current Principal string in a readable format with a \"Copy\" action (uses the authenticated principal from the Internet Identity context when provided by the caller). Use shadcn-ui components (e.g., Card/Button) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Extend AccessDeniedScreen to optionally accept and display the authenticated user's Principal ID (rendered via PrincipalIdPanel) when available, keeping all labels/messages in English. Use the authorization component pattern for Internet Identity principal display; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/RequirePlatformAdmin.tsx",
          "operation": "modify",
          "description": "When rendering the access denied state for authenticated non-platform-admin users, pass the current Principal string to AccessDeniedScreen so the Principal ID is shown. Use the authorization component pattern (Internet Identity identity/principal) to source the Principal ID; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/portals/TeamPortalPage.tsx",
          "operation": "modify",
          "description": "Update /portal/team to show the authenticated Principal ID (via PrincipalIdPanel or AccessDeniedScreen principal support) in the loading and non-admin flows, ensuring the Principal is readable/copyable and all labels are English. Use the authorization component pattern (Internet Identity identity/principal and role check) to source data; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add a platform-admin-only UI screen to add/remove platform admins by Principal ID, wired to the new backend allowlist management capabilities (English labels).",
      "acceptanceCriteria": [
        "There is a platform-admin-only UI to add a Principal ID to the platform admin allowlist",
        "There is a platform-admin-only UI to remove a Principal ID from the platform admin allowlist (with a confirmation dialog)",
        "After adding a Principal ID, revisiting /portal/team while authenticated as that Principal routes to the admin area (per existing Team Portal behavior)",
        "All user-facing labels/messages added for this screen are in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the typed frontend backend interface to include the new platform-admin allowlist management functions introduced by the backend work (add/remove by Principal), so the new UI can call them without type errors."
        },
        {
          "path": "frontend/src/hooks/admin/usePlatformAdminAllowlist.ts",
          "operation": "create",
          "description": "Create React Query mutations for adding/removing platform admins by Principal ID and invalidate role-related queries (e.g., callerRole) on success so updated admin status is reflected when revisiting /portal/team. Use the authorization component pattern for role refresh behavior after allowlist changes; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminPlatformAdminsPage.tsx",
          "operation": "create",
          "description": "Create a platform-admin-only management screen (wrapped with RequirePlatformAdmin) with: (1) an input to add a Principal ID and submit to the backend, and (2) an input to remove a Principal ID with a shadcn-ui confirmation dialog before executing removal. Ensure all labels/messages are English and validate Principal format client-side before calling the backend. Use shadcn-ui components (Input/Button/AlertDialog/Card) for UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire a new admin route (e.g., /admin/platform-admins) to AdminPlatformAdminsPage so it is navigable and not orphaned."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add a platform-admin-only navigation link to the new platform admin management screen under existing admin links, keeping the public navigation unchanged. Use the existing role-based rendering pattern; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}