{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hierarchical product categories (taxonomy) with catalog filtering and nursery product categorization",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Render and consume a parent/child category taxonomy in the UI without hardcoding category names, enabling downstream filtering and selection experiences.",
      "acceptanceCriteria": [
        "Backend Category type supports representing a category tree (parent category with optional subcategories).",
        "Backend exposes categories in a way that the frontend can render the parent/child structure without hardcoding names.",
        "The category taxonomy includes exactly these labels for user-facing text: Plants, Indoor Plants, Outdoor Plants, Seeds, Pots, Ceramic Pots, Plastic Pots, Fiber Pots, Fertilizers (English spelling as written here)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/storefront/useCategories.ts",
          "operation": "modify",
          "description": "Extend category data access to support fetching the hierarchical taxonomy (e.g., via an additional hook that reads the full tree) while keeping the existing flat categories query for compatibility."
        },
        {
          "path": "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts",
          "operation": "create",
          "description": "Add a dedicated React Query hook that loads the hierarchical taxonomy from the backend actor so pages can render parent/child structure without hardcoding. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/categoryTaxonomy.ts",
          "operation": "create",
          "description": "Add helpers to work with the taxonomy in the UI (e.g., flatten with depth/indent label, compute descendant category IDs, and determine leaf nodes) to support hierarchical filtering and leaf-only selection."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the 'Shop by Category' section to consume the hierarchical taxonomy and display only top-level categories (with English labels coming from the backend), linking users into the catalog with a selected category."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update the catalog filtering UI to support hierarchical categories (parents + subcategories) and allow filtering by Pots subcategories while preserving search + filter behavior.",
      "acceptanceCriteria": [
        "Catalog page allows users to filter products by any of the requested categories, including subcategories under Plants and Pots.",
        "Filtering works correctly with search: when a search term is entered, category filtering still narrows results.",
        "All user-facing filter labels are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CatalogPage.tsx",
          "operation": "modify",
          "description": "Replace the flat category tabs with a hierarchical filter UI driven by the fetched taxonomy (e.g., parent groups with selectable subcategories). Use shadcn-ui composed primitives already available in the app to present the hierarchy; verify the component's usage instructions before implementing. Ensure selecting a parent filters by its descendants, and selecting a leaf filters specifically by that leaf (including Pots → Ceramic Pots/Plastic Pots/Fiber Pots). Preserve the existing search behavior and ensure category filtering continues to apply when searchTerm is set."
        },
        {
          "path": "frontend/src/utils/categoryTaxonomy.ts",
          "operation": "modify",
          "description": "Add/adjust taxonomy helper functions used by CatalogPage to (1) find descendants for parent-category filtering and (2) build hierarchical display models for the filter control."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Update the nursery product creation flow to assign a category/subcategory from the structured taxonomy and submit the selected leaf categoryId to the backend.",
      "acceptanceCriteria": [
        "Add Product dialog supports selecting a category from the full taxonomy, including Pots subcategories.",
        "Submitting a new product sends the selected (sub)category ID to the backend and the created product appears in that category filter on the catalog page.",
        "All user-facing text in the nursery product categorization UI is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/nursery/NurseryDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the 'Add New Product' dialog category control to use the hierarchical taxonomy and allow selecting from the full set of categories while ensuring the value sent to the existing add-product mutation is a leaf categoryId. Use shadcn-ui Select composition already in the codebase (grouping/indentation as needed) to represent parent/child structure; verify the component's usage instructions before implementing. Keep all user-facing text in English."
        },
        {
          "path": "frontend/src/hooks/storefront/useFullCategoryTaxonomy.ts",
          "operation": "modify",
          "description": "Ensure the taxonomy hook exposes a convenient shape for the nursery product category picker (e.g., stable query key, loading states) so the dialog can reliably populate hierarchical options."
        },
        {
          "path": "frontend/src/utils/categoryTaxonomy.ts",
          "operation": "modify",
          "description": "Add/adjust a helper that returns leaf-only options (with depth/indent labels) for use in nursery product category selection so only valid leaf categories are submitted as categoryId."
        }
      ]
    }
  ]
}